<a href="https://colab.research.google.com/github/wolfospealain/lab4/blob/main/LabWeek3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab Work

- Ian Spillane
- 40030472@hcstudent.net
- BDA101 Software Development for Business Data Analytics
- Week 3
- 19/10/22

In [ ]:
import pandas as pd

## Task 9

In [ ]:
df = pd.read_csv("titanic.csv")

In [ ]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

* isna() returns True or False for each datum being NA or not.
* sum() calculates the total: 1 for True, 0 for False.

In [ ]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

* isna() returns True or False for each datum being NA or not.
* any() returns if any element is True.

In [ ]:
df['Age'].fillna(float(df['Age'].mean()), inplace=True)

In [ ]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

* fillna() with inplace=True replaces Na in the data with the passed value.
* mean() calculates the average of the column.
* So, any Na in Age was replaced by the mean value,
* And so, sum() shows no Na values remaining in Age.

## Task 10

In [ ]:
medals = {"Gold":[137,47,64,50,44,20,23,8,4,17],
          "Silver":[52,43,55,28,30,55,34,38,4,13],
          "Bronze":[67,67,26,35,35,21,25,24,61,34]}
index = ["United States", "Germany", "Great Britain", "Russia", "China", "France", "Australia", "Italy", "Canada", "Japan"]

In [ ]:
df = pd.DataFrame(medals, index)

In [ ]:
df.to_csv("olympicmedals.csv")

## Task 11

In [ ]:
import json

In [ ]:
df.to_json("olympicmedals.json")

In [ ]:
json.loads(open("olympicmedals.json").read())

{'Gold': {'United States': 137,
  'Germany': 47,
  'Great Britain': 64,
  'Russia': 50,
  'China': 44,
  'France': 20,
  'Australia': 23,
  'Italy': 8,
  'Canada': 4,
  'Japan': 17},
 'Silver': {'United States': 52,
  'Germany': 43,
  'Great Britain': 55,
  'Russia': 28,
  'China': 30,
  'France': 55,
  'Australia': 34,
  'Italy': 38,
  'Canada': 4,
  'Japan': 13},
 'Bronze': {'United States': 67,
  'Germany': 67,
  'Great Britain': 26,
  'Russia': 35,
  'China': 35,
  'France': 21,
  'Australia': 25,
  'Italy': 24,
  'Canada': 61,
  'Japan': 34}}

In [ ]:
df = pd.DataFrame(json.loads(open("olympicmedals.json").read()))

In [ ]:
df

               Gold  Silver  Bronze
United States   137      52      67
Germany          47      43      67
Great Britain    64      55      26
Russia           50      28      35
China            44      30      35
France           20      55      21
Australia        23      34      25
Italy             8      38      24
Canada            4       4      61
Japan            17      13      34

## Task 12

In [ ]:
import numpy as np
df = pd.DataFrame({"name": ['Superman', 'Batman', 'Spiderman'],
                   "toy": [np.nan, 'Batmobile', 'Spiderman toy'],
                   "born": [np.nan, pd.Timestamp("1956-06-26"), np.nan]})

In [ ]:
df

        name            toy       born
0   Superman            NaN        NaT
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

In [ ]:
df.isna()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [ ]:
df.dropna(thresh=2)

        name            toy       born
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

In [ ]:
df.dropna(subset=["toy"])

        name            toy       born
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT